//
//  main.swift
//  #12 @IBAction과 @IBOutlet
//
//  Created by Mangdi on 2022/09/02.
//

import Foundation

// #12 @IBAction과 @IBOutlet

/*
 @IBAction과 @IBOutlet은 함수 앞에 선언해서 사용한다.
 @IBAction은 이벤트에 반응하는 Action을,
 @IBOutlet은 스토리보드에 올려져있는 버튼과 레이블 슬라이더같은 요소와 연결한다.
 @는 컴파일러에게 이런속성을 가지고있다고 전달하는 예약어다.
 
 강좌를 열심히 따라하는도중 오토레이아웃에서 중복속성중 하나를 지우려다가
 실수로 main파일을 지워서 멘탈이 날라갔다. 속성을 누르고 커맨드+백스페눌러서 이상한창뜨길래 무심코 yes했더니
 날라가버린것.. 되돌아가기해도 복구가 안된다.
 그래서 멘탈이 바사삭해서 의욕이 없다 내일 처음부터 생성해서 다시해야겠따..
 다시 복습할수있는 기회라 생각하고 해야지 에휴 ㅠ
 */
